# Item Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCAggregate..::..Item Property
IFCAggregate Class See Also
---
Get the IFCData for this aggregate.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public IFCData this[
	int index
] { get; }
```

Visual Basic
---
```text
Public ReadOnly Default Property Item ( _
	index As Integer _
) As IFCData
	Get
```

Visual C++
---
```text
public:
property IFCData^ default[int index] {
	IFCData^ get (int index);
}
```

# ### Parameters
index
    Type: System..::..Int32 The index.
# ### Return Value
The IFCData.
# See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace